Documents/ОбучениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ОбучениеСотрудников</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Учащиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОбучениеСотрудников/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УчащиесяПриИзменении(Элемент)
	Объект.СуммаДокумента = СуммаДокумента();
КонецПроцедуры


&НаСервереБезКонтекста
Функция СтоимостьКурса( Курс)
	Возврат Курс.Сумма;
КонецФункции // СтоимостьКурса()


&НаСервере
Процедура ПересчетСтоимостиОбучения()
	СтоимостьКурса = СтоимостьКурса( Объект.Курс );
	Для Каждого Уч ИЗ Объект.Учащиеся Цикл
		Уч.Сумма = СтоимостьКурса;
	КонецЦикла;

	Объект.СуммаДокумента = СуммаДокумента();
КонецПроцедуры // ПересчетСтоимостиОбучения()()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция СуммаДокумента()
	Возврат Объект.Учащиеся.Итог("Сумма");
КонецФункции // СуммаДокумента()



&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	ПересчетСтоимостиОбучения();
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура РаспределитьСуммуПоУчащимся();
	Если СуммаДокумента() = 0 Тогда Возврат; КонецЕсли;
	
	МассивКоэфф = Новый Массив;
	Для Каждого Стр ИЗ Объект.Учащиеся Цикл
		// 
		БазаРаспределения = Стр.Сумма; //  
		МассивКоэфф.Добавить( БазаРаспределения );
	КонецЦикла;
	мРез = РаспределитьПропорционально( Объект.СуммаДокумента, МассивКоэфф);
	Для Каждого Стр ИЗ Объект.Учащиеся Цикл
		Если мРез <> Неопределено Тогда
			Стр.Сумма	= мРез[Объект.Учащиеся.Индекс(Стр)];
		Иначе
			Стр.Сумма	= 0;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // РаспределитьСуммуПоУчащимся();()


// сумму разделяем пропорционально указанной для каждого учащегося
&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	РаспределитьСуммуПоУчащимся();
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.Учащиеся.ТекущиеДанные;
	Если ТекущиеДанные.Сумма = 0 Тогда
		ТекущиеДанные.Сумма = СтоимостьКурса( Объект.Курс );
	КонецЕсли;
КонецПроцедуры
